## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_acm_certificate_validation.notification-canada-ca-alt[0]` |
|        | `aws_acm_certificate_validation.notification-canada-ca[0]`     |
|        | `aws_route53_record.notificatio-root-WC`                       |
|        | `aws_route53_record.notification-canada-ca-alt[0]`             |
|        | `aws_route53_record.notification-canada-ca[0]`                 |
|        | `aws_route53_record.notification-root`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate_validation.notification-canada-ca[0] will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/db0b2d43-d054-4c2f-b991-a946f665b445"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt[0] will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.notificatio-root-WC will be created
  + resource "aws_route53_record" "notificatio-root-WC" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.notification-canada-ca[0] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt[0] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-root will be created
  + resource "aws_route53_record" "notification-root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-beat-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main...
```

</details>
